app/views/comments/edit.html.erb

<p>le gossip est le n°<%= @gossip.id%></p>
<p>l'auteur est : <%= @gossip.user.first_name%></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]