app/views/gossips/new.html.erb

SELECT "tags".* FROM "tags"
---
  <br /> <br />
  <%= select_tag 'tag[]', options_for_select(@tags.map{|tag| tag.title }), multiple: true %>