app/views/gossips/show.html.erb

<h5>Tags :</h5>
<% @gossip.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "join_table_gossip_tags" ON "tags"."id" = "join_table_gossip_tags"."tag_id" WHERE "join_table_gossip_tags"."gossip_id" = $1  [["gossip_id", 5]]

<%= comment.content %><br /><br />
<%= comment.user.first_name %><br /><br />
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

<%= comment.content %><br /><br />
<%= comment.user.first_name %><br /><br />
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]