app/controllers/comments_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
  	@gossip = Gossip.find(params[:gossip_id])

SELECT  "users".* FROM "users" WHERE "users"."first_name" = $1 LIMIT $2  [["first_name", "Anonymous"], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "gossip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "kndfdljfn"], ["user_id", 1], ["gossip_id", 1], ["created_at", "2019-02-07 09:37:49.384346"], ["updated_at", "2019-02-07 09:37:49.384346"]]
---
  def create
  	@user = User.find_by(first_name: "Anonymous")
  	@gossip = Gossip.find(params[:gossip_id])
  	@comment = Comment.new('content' => params[:content], 'user' => @user, 'gossip' => @gossip)
  	if @comment.save # essaie de sauvegarder en base @gossip

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]
---
  def edit
  	@gossip = Gossip.find(params[:gossip_id])
  	@comment = Comment.find(params[:id])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]
---
  def update
  	@comment = Comment.find(params[:id])