app/controllers/gossips_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
  	@gossip = Gossip.new('title' => params[:title], 'content' => params[:content], 'user' => User.find(11))