app/controllers/gossips_controller.rb

  def show
  	@gossip = Gossip.find(params[:id])
  	@author = @gossip.user
  	@first_name = @author.first_name
    @comments = Comment.where(gossip_id: params[:id], commentable_type: nil)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."first_name" = $1 LIMIT $2  [["first_name", "Anonymous"], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1 AND "comments"."commentable_type" = $2  [["gossip_id", 5], ["commentable_type", "Comment"]]

  def new
  	@gossip = Gossip.new
    @tags = Tag.all
---
SELECT "tags".* FROM "tags"

  def create
  	@user = User.find_by(first_name: "Anonymous")
  	@gossip = Gossip.new('title' => params[:title], 'content' => params[:content], 'user' => @user)
    params[:tag].each do |tag|
      tag_interim = Tag.find_by(title: tag)
      @join_table = JoinTableGossipTag.new('gossip' => @gossip, 'tag' => tag_interim)
      @join_table.save
---
SELECT  "users".* FROM "users" WHERE "users"."first_name" = $1 LIMIT $2  [["first_name", "Anonymous"], ["LIMIT", 1]]
SELECT  "tags".* FROM "tags" WHERE "tags"."title" = $1 LIMIT $2  [["title", "Narrative nonfiction"], ["LIMIT", 1]]
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "RPUT"], ["content", "PROUT"], ["user_id", 1], ["created_at", "2019-02-07 09:44:10.834787"], ["updated_at", "2019-02-07 09:44:10.834787"]]
INSERT INTO "join_table_gossip_tags" ("gossip_id", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["gossip_id", 22], ["tag_id", 3], ["created_at", "2019-02-07 09:44:10.837197"], ["updated_at", "2019-02-07 09:44:10.837197"]]